{
    "version": "https://jsonfeed.org/version/1",
    "title": "Adventures in Learning",
    "description": "",
    "home_page_url": "http://paulnorthup.com",
    "feed_url": "http://paulnorthup.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Paul Northup"
    },
    "items": [
        {
            "id": "http://paulnorthup.com/frame-modifications.html",
            "url": "http://paulnorthup.com/frame-modifications.html",
            "title": "Rear subframe modifications",
            "summary": "I started by cutting the back of the rear subframe off and welding on a new hoop to give a nice clean rounded \"butt\" to the bike. I realized there was a problem with the new hoop when I mocked up a seat with some&hellip;",
            "content_html": "<p>I started by cutting the back of the rear subframe off and welding on a new hoop to give a nice clean rounded \"butt\" to the bike.</p>\n<figure class=\"post__image post__image--center\" ><img src=\"http://paulnorthup.com/media/posts/1/rear-hoop.jpg\" alt=\"New hoop welded on\" width=\"580\" height=\"600\">\n<figcaption >New hoop welded on</figcaption>\n</figure>\n<p>I realized there was a problem with the new hoop when I mocked up a seat with some carpet foam. I figured a standard size café/brat seat would look pretty good, so I went with ~2\" of foam, but it looked horrible. The angle of the rear subframe on the LTD model of a KZ550 is steep to support a two-up \"King and Queen\" seat, not the style I was looking for.</p>\n<figure class=\"post__image post__image--center\" ><img src=\"http://paulnorthup.com/media/posts/1/ugly-seat.JPG\" alt=\"\" width=\"600\" height=\"450\">\n<figcaption >Here is the ugly seat, with the tire mocked up for positioning. The ramp is longer than the flat section... yuck.</figcaption>\n</figure>\n<p>I spent some time thinking about the seat frame, mocking up different seat options with cardboard, etc. After a while, I got so frustrated with making no progress I cut off the hoop, chopped the rest of the rear seat frame off, and welded the hoop back on. this gave me a much more aggressive look, and the proportions really started to come together.</p>\n<figure class=\"post__image post__image--center\" ><img src=\"http://paulnorthup.com/media/posts/1/short-seat.JPG\" alt=\"\" width=\"2072\" height=\"1554\">\n<figcaption >If life gives you subframe lemons, chop them right out and don't worry about 'em.</figcaption>\n</figure>\n<p>Along with the subframe work, I grinded off the rest of the frame tabs I wasn't going to use and bent the old rear shock mount supports around the new hoop to keep the original lines of the bike. Happy with the progress so far.<br><br></p>\n<p> </p>",
            "author": {
                "name": "Paul Northup"
            },
            "tags": [
                   "Motorcycle",
                   "KZ550"
            ],
            "date_published": "2020-04-02T07:54:04-04:00",
            "date_modified": "2020-04-14T11:26:24-04:00"
        }
    ]
}
